; domain
(define (domain dom)

    (:predicates (onLeft ?x))

    (:action cross
        :parameters (?x)
        :precondition   (or 
                            (and ; farmer can pass if goose and fox are not at the same side and beans and goose are not at the same side
                                (= farmer ?x)
                                (and
                                    (or ;goose and fox are not at the same side
                                        (and
                                            (onLeft goose)
                                            (not(onLeft fox))
                                        )
                                        (and
                                            (onLeft fox)
                                            (not(onLeft goose))
                                        )
                                    )
                                    (or ;goose and beans are not at the same side
                                        (and
                                            (onLeft beans)
                                            (not(onLeft goose))
                                        )
                                        (and
                                            (onLeft goose)
                                            (not(onLeft beans))
                                        )
                                    )
                                ) 
                            )
                            (and ;(x and farmer at the same side) (x == fox or x == beans) and 
                                (or ;x has to be at the same side with farmer in order to pass
                                    (and 
                                        (onLeft farmer)
                                        (onLeft ?x)
                                    )
                                    (and 
                                        (not(onLeft farmer))
                                        (not(onLeft ?x))
                                    )
                                )
                                (or
                                    (= goose ?x) ;goose can pass with the farmer without any precondition
                                    (and ;if x is beans
                                        (= beans ?x)
                                        (or 
                                            (and
                                                (onLeft fox)
                                                (not(onLeft goose))
                                            )
                                            (and
                                                (onLeft goose)
                                                (not(onLeft fox))
                                            )
                                        )
                                    )
                                    (and ;if x is fox
                                        (= fox ?x)
                                        (or 
                                            (and
                                                (onLeft beans)
                                                (not(onLeft goose))
                                            )
                                            (and
                                                (onLeft goose)
                                                (not(onLeft beans))
                                            )
                                        )
                                    )
                                ) 
                            )     
                        )
        :effect 
            (and
                (when (onLeft farmer) (not(onLeft farmer))) 
                (when (not(onLeft farmer)) (onLeft farmer)) 
                (when (onLeft ?x) (not (onLeft ?x)))  
                (when (not (onLeft ?x)) (onLeft ?x)) 
            )
    )
)

; problem
(define (problem prob)
    (:domain dom)

    (:objects farmer fox goose beans) ;objects
    (:init 
         (onLeft farmer)
         (onLeft fox)
         (onLeft goose)
         (onLeft beans))
    
    (:goal (and (not (onLeft farmer))
                (not (onLeft fox))
                (not (onLeft goose))
                (not (onLeft beans))
            )
    )
)

; plan
1. (cross goose)
   deleted: (onleft farmer) (onleft goose)
   goals met: 2 of 4
2. (cross farmer)
   added: (onleft farmer)
   goals met: 1 of 4
3. (cross beans)
   deleted: (onleft farmer) (onleft beans)
   goals met: 3 of 4
4. (cross goose)
   added: (onleft farmer) (onleft goose)
   goals met: 1 of 4
5. (cross fox)
   deleted: (onleft farmer) (onleft fox)
   goals met: 3 of 4
6. (cross farmer)
   added: (onleft farmer)
   goals met: 2 of 4
7. (cross goose)
   deleted: (onleft farmer) (onleft goose)
   goals met: 4 of 4
